# Приклад 3: Відловлення кількох помилок
# Можна обробити декілька типів помилок одразу.

print("66 ending program")

while True:

    try:
        x = int(input("Введіть число: "))
        if x == 66:
            break
        y = 10 / x
        print(f"Результат: {y}")
    except ValueError: # відловлює помилку і ретурніт до виконання
        print("❌ Потрібно вводити число!")
    except ZeroDivisionError: # відловлює помилку і ретурніт до виконання
        print("❌ Не можна ділити на нуль!")
   # finally: # виконується завжди навіть якщо помилка
       # print("🔚 Програма завершила роботу.")

print("Гарного дня")